---
kind: type
id: T:Autodesk.Revit.DB.ValueAtPointFlags
source: html/7b08366e-61ca-caec-c097-173137ba48c5.htm
---
# Autodesk.Revit.DB.ValueAtPointFlags

Enumerated type containing flags related to the display on particular points.
 Enumerated type that stores bit values of flags that can be set at any domain point.

## Syntax (C#)
```csharp
public enum ValueAtPointFlags
```